# Pandas technical interview prep on e-commerce datasets

In [1]:
import os
import sys
import pandas as pd

In [2]:
os.getcwd()

'/Users/neilbardhan/Documents/python-projects/technical-interview-prep/data/notebooks'

In [3]:
os.chdir('..')

## Reading in the Datasets

In [6]:
DATASETS_ROOT = os.getcwd() + '/datasets/'
DATASETS_ROOT

'/Users/neilbardhan/Documents/python-projects/technical-interview-prep/data/datasets/'

### Customer Table

In [5]:
customer_df = pd.read_csv(DATASETS_ROOT + 'customers.csv')
print(customer_df.shape)
customer_df.head()

(750, 5)

,customer_id,name,email,signup_date,country
0,1,Joshua Lane,gary34@example.org,2022-09-12,China
1,2,Melissa Atkins,varellano@example.net,2024-12-25,China
2,3,Barry Ray,bentonashley@example.org,2025-03-27,Togo
3,4,Mary Carter DDS,angelicajones@example.net,2024-12-28,French Polynesia
4,5,Thomas Weber,greg59@example.net,2025-03-19,Mali

### Product Table

In [7]:
product_df = pd.read_csv(DATASETS_ROOT + 'products.csv')
print(product_df.shape)
product_df.head()

(200, 4)

   product_id     name category   price
0           1    Skill    Books  311.56
1           2   Report     Toys  439.10
2           3    Voice    Books  282.50
3           4     Cold     Home  166.65
4           5  Provide    Books  127.10

### Transactions Master Table

In [8]:
transactions_df = pd.read_csv(DATASETS_ROOT + 'transactions.csv')
print(transactions_df.shape)
transactions_df.head()

(4099, 4)

   order_id  customer_id  order_date  total_amount
0         1            1  2023-01-20         14.29
1         2            1  2024-01-01        347.09
2         3            1  2023-01-12       1839.04
3         4            1  2024-09-11       3016.45
4         5            2  2023-06-20       2001.33

### Transactions Items Table

In [9]:
transactions_items_df = pd.read_csv(DATASETS_ROOT + 'transactions_items.csv')
print(transactions_items_df.shape)
transactions_items_df.head()

(12359, 5)

   order_item_id  order_id  product_id  quantity  item_price
0              1         1         155         1       14.29
1              2         2          43         1      347.09
2              3         3         170         1       54.50
3              4         3         145         2      420.33
4              5         3          89         2      359.01

### Reviews Table

In [11]:
reviews_df = pd.read_csv(DATASETS_ROOT + 'reviews.csv')
print(reviews_df.shape)
reviews_df.head()

(1429, 5)

   review_id  order_id  product_id  rating review_date
0          1       492          51       2  2024-06-22
1          2      3796          26       3  2024-12-26
2          3      1905          73       4  2023-05-29
3          4      4031         163       1  2024-12-26
4          5      1218         155       2  2024-03-11

## Pandas Questions

#### Top 5 countries with most customers

In [13]:
customer_df['country'].value_counts().sort_values(ascending=False).head(5)

country
Saudi Arabia                        9
Ireland                             9
Kuwait                              8
Saint Vincent and the Grenadines    8
Niger                               7
Name: count, dtype: int64

#### Top 5 categories with most products

In [14]:
product_df['category'].value_counts().sort_values(ascending=False).head(5)

category
Clothing       45
Books          42
Electronics    42
Toys           39
Home           32
Name: count, dtype: int64

#### Top 5 most popular items by quamtity purchased

In [32]:
top_5_product_ids = transactions_items_df.groupby("product_id")[["quantity"]].aggregate("sum").reset_index().sort_values(by="quantity", ascending=False).head(5)
top_5_product_ids

     product_id  quantity
7             8       164
137         138       164
160         161       163
66           67       162
116         117       160

In [33]:
top_5_join_product = top_5_product_ids.merge(product_df, on = 'product_id')
top_5_join_product

   product_id  quantity       name     category   price
0           8       164     Better  Electronics  486.09
1         138       164     Weight         Home  131.57
2         161       163       Book         Toys  201.32
3          67       162       Test     Clothing  453.74
4         117       160  Political     Clothing  436.68

#### Top 5 transactions by number of unique items

In [37]:
transactions_items_df.groupby("order_id")[["product_id"]].aggregate("count").reset_index().sort_values(by="product_id", ascending=False).head(5)

      order_id  product_id
12          13           5
8            9           5
2480      2481           5
2478      2479           5
52          53           5

#### Top 5 most popular categories by number of orders

In [41]:
transactions_items_product_df = transactions_items_df.merge(product_df, on = 'product_id')
transactions_items_product_df.groupby("category")[["order_id"]].aggregate("count").reset_index().sort_values(by="order_id", ascending=False).head(5)

      category  order_id
1     Clothing      2833
2  Electronics      2611
0        Books      2570
4         Toys      2437
3         Home      1908